In [ ]:
#import libraries 
import pandas  as pd
import numpy as np
import seaborn as  sns

In [ ]:
#load the data.
df = pd.read_csv("employee_data_1000.csv")

In [3]:
#To print the first five rows of data

df.head()

,ID,Name,Age,Gender,Salary,Joining Date,Is Active,Comments
0,1,Paul_1,25,Female,90041.86,2017-01-31,False,Creative
1,2,Paul_2,31,Male,90285.02,2019-05-29,False,Needs Improvement
2,3,Rachel_3,30,Male,84321.65,2022-12-14,False,Hardworking
3,4,Bob_4,45,Male,68189.99,2023-09-05,True,Fast Learner
4,5,Eve_5,34,Male,35428.35,2018-05-19,True,Dedicated

In [4]:
#To check the shape of data
df.shape

(1000, 8)

In [5]:
df.describe()

                ID          Age        Salary
count  1000.000000  1000.000000   1000.000000
mean    500.500000    33.000000  73653.374000
std     288.819436     6.666667  20746.852382
min       1.000000    25.000000  35428.350000
25%     250.750000    30.000000  68189.990000
50%     500.500000    31.000000  84321.650000
75%     750.250000    34.000000  90041.860000
max    1000.000000    45.000000  90285.020000

In [6]:
duplicates = df[df.duplicated()]
print(duplicates)

Empty DataFrame
Columns: [ID, Name, Age, Gender, Salary, Joining Date, Is Active, Comments]
Index: []

In [7]:
# to check the null value
df.isnull().sum()

ID              0
Name            0
Age             0
Gender          0
Salary          0
Joining Date    0
Is Active       0
Comments        0
dtype: int64

In [8]:
# to check the datatype 
df.dtypes

ID                int64
Name             object
Age               int64
Gender           object
Salary          float64
Joining Date     object
Is Active          bool
Comments         object
dtype: object

In [9]:
# Fill the missing values if they are missing
# Numerical data fill with median.
df['Age']= df['Age'].fillna(df['Age'].median())
df['Salary'] = df['Salary'].fillna(df['Salary'].median())

In [10]:
# if name or gender is missing fill with most common value like that mode
df['Name'] = df['Name'].fillna(df['Name'].mode()[0])
df['Gender'] = df['Gender'].fillna(df['Gender'].mode()[0])

In [11]:
#if is active is missing then fill with mode
df['Is Active'] = df['Is Active'].fillna(df['Is Active'].mode()[0])

In [12]:
# if comments are missing fill with unkown
df['Comments'] = df['Comments'].fillna("Unkown")

In [13]:
# if joining date is missing fill with the earliest date in column
df['Joining Date'] = df['Joining Date'].fillna(df['Joining Date'].min())

### Label Encoding
For categorical variables, we can use label encoding to `convert them into numerical values`. This is useful for algorithms that require numerical input.

In [14]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
df['Gender'] = le.fit_transform(df['Gender'])
df['Is Active'] = le.fit_transform(df['Is Active'])

print(df.head(2))

   ID    Name  Age  Gender    Salary Joining Date  Is Active  \
0   1  Paul_1   25       0  90041.86   2017-01-31          0
1   2  Paul_2   31       1  90285.02   2019-05-29          0

            Comments
0           Creative
1  Needs Improvement

### One hot encoding
One hot encoding is a technique to convert categorical variables into a format that can be provided to ML algorithms to do a better job in prediction. It creates binary columns for each category and returns a sparse matrix or dense array.

In [15]:
# apply pd.get dummies for  one hot encoding
encoded = pd.get_dummies(df['Is Active'], prefix= 'Is Active')

encoded.head()

   Is Active_0  Is Active_1
0         True        False
1         True        False
2         True        False
3        False         True
4        False         True

Now we need to concate these columns with the original dataframe. We can use the `pd.concat()` function to do this.
```python

In [16]:
df = pd.concat([df , encoded] , axis = 1).drop (columns=['Is Active'])

In [17]:
df.head(3)

,ID,Name,Age,Gender,Salary,Joining Date,Comments,Is Active_0,Is Active_1
0,1,Paul_1,25,0,90041.86,2017-01-31,Creative,True,False
1,2,Paul_2,31,1,90285.02,2019-05-29,Needs Improvement,True,False
2,3,Rachel_3,30,1,84321.65,2022-12-14,Hardworking,True,False

## Lecture 5

### normalize and scaling

In [27]:
import pandas as pd
df = pd.read_csv("employee_data_1000.csv")
df.head(3)

,ID,Name,Age,Gender,Salary,Joining Date,Is Active,Comments
0,1,Paul_1,25,Female,90041.86,2017-01-31,False,Creative
1,2,Paul_2,31,Male,90285.02,2019-05-29,False,Needs Improvement
2,3,Rachel_3,30,Male,84321.65,2022-12-14,False,Hardworking

In [25]:
#min max scaler convert the value in the range between "0 " and  "1from sklearn.preprocessing import MinMaxScaler

from sklearn.preprocessing import MinMaxScaler
# initialize scaler
scaler = MinMaxScaler()

# Apply min max sacling to 'age' and "salary" column
df[['Age' , 'Salary']] = scaler.fit_transform(df[['Age' , 'Salary']])

df[['Age' , 'Salary']].head()

    Age    Salary
0  0.00  0.995567
1  0.30  1.000000
2  0.25  0.891292
3  1.00  0.597223
4  0.45  0.000000

In [ ]:
# In standard scaler we convert the value in 0 and -1 range
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

df[['Age' , 'Salary']] = scaler.fit_transform(df[['Age' , 'Salary']])

df[['Age' , 'Salary']].head()

        Age    Salary
0 -1.200600  0.790322
1 -0.300150  0.802048
2 -0.450225  0.514469
3  1.800901 -0.263467
4  0.150075 -1.843371

### Label Encoding
Label encoding is a technique used to convert categorical variables into numerical values. This is useful for algorithms that require numerical input.

In [21]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

df['Encoded_Gender'] = le.fit_transform (df['Gender'])

# display gender encoded gender column
df[['Gender' , 'Encoded_Gender']].head()

   Gender  Encoded_Gender
0  Female               0
1    Male               1
2    Male               1
3    Male               1
4    Male               1

### One hot encoding
One hot encoding is a technique to convert categorical variables into a format that can be provided to ML algorithms to do a better job in prediction. It creates binary columns for each category and returns a sparse matrix or dense array.

In [22]:
df = pd.get_dummies(df, drop_first= True)

print(df.head())

   ID  Age    Salary  Is Active  Encoded_Gender  Name_Bob_109  Name_Bob_114  \
0   1   25  90041.86      False               0         False         False
1   2   31  90285.02      False               1         False         False
2   3   30  84321.65      False               1         False         False
3   4   45  68189.99       True               1         False         False
4   5   34  35428.35       True               1         False         False

   Name_Bob_119  Name_Bob_124  Name_Bob_129  ...  Name_Rachel_998  \
0         False         False         False  ...            False
1         False         False         False  ...            False
2         False         False         False  ...            False
3         False         False         False  ...            False
4         False         False         False  ...            False

   Gender_Male  Joining Date_2018-05-19  Joining Date_2019-05-29  \
0        False                    False                    False
1         True                    False                     True
2         True                    False                    False
3         True                    False                    False
4         True                     True                    False

   Joining Date_2022-12-14  Joining Date_2023-09-05  Comments_Dedicated  \
0                    False                    False               False
1                    False                    False               False
2                     True                    False               False
3                    False                     True               False
4                    False                    False                True

   Comments_Fast Learner  Comments_Hardworking  Comments_Needs Improvement
0                  False                 False                       False
1                  False                 False                        True
2                  False                  True                       False
3                   True                 False                       False
4                  False                 False                       False

[5 rows x 1013 columns]

### Outlier detection using z-score method

In [35]:
from scipy.stats import zscore
import numpy as np

# calculate z_score for age and salary column
z_score = np.abs(df[['Age', 'Salary']])

# identify rows with z_score > 3
outliers = (z_score > 3 ).any(axis= 1)

#Remove outlier  from the dataset
df_no_outlier = df[outliers]

df_no_outlier.head()

,ID,Name,Age,Gender,Salary,Joining Date,Is Active,Comments
0,1,Paul_1,25,Female,90041.86,2017-01-31,False,Creative
1,2,Paul_2,31,Male,90285.02,2019-05-29,False,Needs Improvement
2,3,Rachel_3,30,Male,84321.65,2022-12-14,False,Hardworking
3,4,Bob_4,45,Male,68189.99,2023-09-05,True,Fast Learner
4,5,Eve_5,34,Male,35428.35,2018-05-19,True,Dedicated